/***********************************************************************************************
 *  System          : Nine Times Table
 *  Program ID      : ninetimestable.c
 *  Description     : 구구단 출력 프로그램
 *  Author          : Jiyeoning
 ************************************************************************************************/

 /*--<HEADER FILES>------------------------------------------------------------------------------*/
#include    <stdio.h>
#include    <string.h>
#include    <stdlib.h>


/*--<DEFINE CONSTANTS>--------------------------------------------------------------------------*/



/*--<VARIABLES>---------------------------------------------------------------------------------*/
char    inputarr        [100];                      /* 입력값 배열 */
char    timesarr        [100][24];                  /* 구구단 배열 */
int     posX            = 0;
int     posY            = 0;
int     len             = 0;


/*--<FUNCTION PROTOTYPE>------------------------------------------------------------------------*/
void    Description     ();
int     InputCheck01    ();
int     InputCheck02    ();
void    Calculate       (int n);
int     PrintTimesTable ();


/*----------------------------------------------------------------------------------------------
 * Function     : main
 * Description  : 구구단 출력 프로그램의 main 함수
 * Input param  : 
 * Output param :
 * Return value : 
 *----------------------------------------------------------------------------------------------*/
int main()
{
    int checknum = 0;

    Description();
    checknum = InputCheck01(); /* 0: OK , 1: ERR */

    if (checknum == 0)
    {
        InputCheck02();
        PrintTimesTable();
    }
    
    printf("\n\n프로그램 종료.\n");
    return 0;
} /* End of main */

/*----------------------------------------------------------------------------------------------
 * Function     : Description
 * Description  : 프로그램명과 입력방법 출력 함수.
 *----------------------------------------------------------------------------------------------*/
void Description()
{
    printf("\n\n[NINE-TIMES-TABLE]\n\n");
    printf("출력을 원하는 구구단의 단수를 아래의 입력방법을 참고해 입력하세요.\n");
    printf("2단부터 9단까지 출력이 가능합니다.\n");
    printf("\n< 입력방법 >\n");
    printf("* 한 개의 숫자 입력 (ex. 2)\n");
    printf("* 콤마(,)를 이용한 입력 (ex. 2,4,5)\n");
    printf("* 물결(~)을 이용한 입력 (ex. 2~5)\n");
    printf("* 콤마(,)와 물결(~)을 이용한 입력 (ex. 2,4~6,9)\n");
    printf("\n\n입 력 : ");
    scanf("%s", inputarr);

} /* End of Description */

/*----------------------------------------------------------------------------------------------
 * Function     : InputCheck01
 * Description  : 사용자 입력값이 유효한지 검사.
 *               콤마(,)와 물결(~)이 연속되거나 숫자가 연속되면 에러메시지 출력.
 * Input param  : char inputarr[100]
 * Return value : 0(OK), 1(ERR)
 *----------------------------------------------------------------------------------------------*/
int InputCheck01()
{
    for (int i = 0; i < 100; i++)
    {
        /*--------------------------------------------
        * 입력값 중 0 또는 1이 있을 때
        *--------------------------------------------*/
        if (inputarr[i] == 0x30 || inputarr[i] == 0x31)
        {
            printf("ERR : 2단부터 9단까지 출력이 가능합니다.\n");
            return 1;
        }
        /*--------------------------------------------
        * 입력값 중 2부터 9 사이의 숫자가 연속될 때
        *--------------------------------------------*/
        else if (inputarr[i] >= 0x32 && inputarr[i] <= 0x39)
        {
            if (inputarr[i + 1] >= 0x32 && inputarr[i + 1] <= 0x39)
            {
                printf("ERR : 2단부터 9단까지 출력이 가능합니다.\n");
                return 1;
            }            
        }
        /*--------------------------------------------
        * 입력값 중 문자가 반복될 때
        *--------------------------------------------*/
        else if (inputarr[i] == 0x2c || inputarr[i] == 0x7e)
        {
            if (inputarr[i + 1] == 0x2c || inputarr[i + 1] == 0x7e)
            {
                printf("ERR : 문자는 한 개씩\n");
                return 1;
            }            
        }
    }
    return 0;

} /* End of InputCheck01 */

/*----------------------------------------------------------------------------------------------
 * Function     : InputCheck02
 * Description  : 사용자 입력값을 숫자, 콤마(,), 물결(~)로 구분하여 계산 함수로 전달.
 *----------------------------------------------------------------------------------------------*/
int InputCheck02()
{
    int n1 = 0;
    int n2 = 0;

    len = strlen(inputarr);

    for (int i = 0; i < len; i++)
    {
        if (inputarr[i] >= 0x32 && inputarr[i] <= 0x39)
        {
            /*--------------------------------------------
            * 숫자 다음 물결(~)이 있을 때
            *--------------------------------------------*/
            if (inputarr[i+1] == 0x7e)
            {
                n1 = atoi(&inputarr[i]);
                n2 = atoi(&inputarr[i + 2]);

                if (n2 > n1)
                {
                    while (n1 <= n2)
                    {
                        Calculate(n1);
                        n1++;
                    }
                }
                else
                {
                    while (n2 <= n1)
                    {
                        Calculate(n2);
                        n2++;
                    }
                }
                i++;
            }
            else
            {
                n1 = atoi(&inputarr[i]);
                Calculate(n1);
            }
        }
        /*--------------------------------------------
        * 공백이 연속되면 끝냄
        *--------------------------------------------*/
        else if (inputarr[i] == 0x00 && inputarr[i+1] == 0x00)
        {
            return 0;
        }
    }
    return 0;
} /* End of InputCheck02 */

/*----------------------------------------------------------------------------------------------
 * Function     : Calculate
 * Description  : 전달받은 인자를 계산해 timesarr 배열에 대입.
 * Input param  : int i
 *----------------------------------------------------------------------------------------------*/
void Calculate(int n)
{
    for (int i = posY; i < (posY + 9); i++)
    {
        for (int j = posX; j < (posX + 8); j++)
        {
            /*--------------------------------------------
            * 구구단의 맨 앞 숫자 채우기
            *--------------------------------------------*/
            if (j == 0 || j == 8 || j == 16)
            {
                timesarr[i][j] = n + '0'; /* 숫자를 아스키코드로 변환 */
            }
            /*--------------------------------------------
            * 구구단의 곱셈문자(X) 채우기
            *--------------------------------------------*/
            else if (j == 1 || j == 9 || j == 17)
            {
                timesarr[i][j] = 'X';
            }
            /*--------------------------------------------
            * 구구단의 등호(=) 채우기
            *--------------------------------------------*/
            else if (j == 3 || j == 11 || j == 19)
            {
                timesarr[i][j] = '=';
            }
            /*--------------------------------------------
            * 구구단의 1~9까지 채우기
            *--------------------------------------------*/
            else if (j == 2 || j == 10 || j == 18)
            {
                timesarr[i][j] = (i % 9) + 1 + '0'; /* 숫자를 아스키코드로 변환 */
            }
            /*--------------------------------------------
            * 구구단의 결과값 채우기
            *--------------------------------------------*/
            else if (j == 4 || j == 12 || j == 20)
            {
                timesarr[i][j] = n * ((i % 9) + 1);
            }
            /*--------------------------------------------
            * 구분선 채우기
            *--------------------------------------------*/
            else if (j == 6 || j == 14 || j == 22)
            {
                timesarr[i][j] = '|';
            }
            else
            {
                timesarr[i][j] = ' ';
            }
        }
    }

    if (posX == 16)
    {
        posX = 0;
        posY += 9;
    }
    else
    {
        posX += 8;
    }

} /* End of Calculate */

/*----------------------------------------------------------------------------------------------
 * Function     : PrintTimesTable
 * Description  : timesarr 배열을 출력.
 *----------------------------------------------------------------------------------------------*/
int PrintTimesTable()
{
    printf("\n");

    for (int i = 0; i < 100; i++)
    {
        for (int j = 0; j < 24; j++)
        {
            if (j == 4 || j == 12 || j == 20)
            {
                printf("%3d", timesarr[i][j]);
            }
            else
            {
                printf("%3c", timesarr[i][j]);
            }

            if (timesarr[i][j] == 0x00 && timesarr[i][j+4] == 0x00)
            {
                return 0;
            }
            else if (j == 23 && (i + 1) % 9 == 0)
            {
                printf("\n");
            }
        }
        printf("\n");
    }  

    return 0;
} /* End of PrintTimesTable */